Model: "auto_e"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 1400, 1)]         0         
_________________________________________________________________
encoder (Functional)         (None, 700)               1308828   
_________________________________________________________________
decoder (Functional)         (None, 1400, 1)           1489793   
=================================================================
Total params: 2,798,621
Trainable params: 2,798,429
Non-trainable params: 192
_________________________________________________________________
