Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoder_input (InputLayer)   [(None, 1400, 1)]         0         
_________________________________________________________________
block1_conv1 (Conv1D)        (None, 1400, 32)          2080      
_________________________________________________________________
batch_normalization (BatchNo (None, 1400, 32)          128       
_________________________________________________________________
block1_pool (AveragePooling1 (None, 700, 32)           0         
_________________________________________________________________
block2_conv1 (Conv1D)        (None, 700, 64)           51264     
_________________________________________________________________
batch_normalization_1 (Batch (None, 700, 64)           256       
_________________________________________________________________
block2_pool (AveragePooling1 (None, 28, 64)            0         
_________________________________________________________________
flatten (Flatten)            (None, 1792)              0         
_________________________________________________________________
latent (Dense)               (None, 700)               1255100   
=================================================================
Total params: 1,308,828
Trainable params: 1,308,636
Non-trainable params: 192
_________________________________________________________________
