Model: "ascad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 700, 1)]          0         
_________________________________________________________________
block1_conv1 (Conv1D)        (None, 700, 4)            8         
_________________________________________________________________
batch_normalization (BatchNo (None, 700, 4)            16        
_________________________________________________________________
block1_pool (AveragePooling1 (None, 350, 4)            0         
_________________________________________________________________
flatten (Flatten)            (None, 1400)              0         
_________________________________________________________________
fc1 (Dense)                  (None, 10)                14010     
_________________________________________________________________
fc2 (Dense)                  (None, 10)                110       
_________________________________________________________________
fc3 (Dense)                  (None, 10)                110       
_________________________________________________________________
predictions (Dense)          (None, 256)               2816      
=================================================================
Total params: 17,070
Trainable params: 17,062
Non-trainable params: 8
_________________________________________________________________
